
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаПериодОстатков.Видимость = Параметры.РежимОстатков;
	Элементы.ГруппаПериодОборотов.Видимость = НЕ Параметры.РежимОстатков;
	
	ЭтаФорма.Заголовок = "РегистрНакопления." + Параметры.ИмяРегистра;
	
	ЗаполнитьИсходныеДанные();
	         	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсходныеДанные()
	
	Если Параметры.Хранилище <> Неопределено Тогда
		
		ДляЗаполнения = Параметры.Хранилище.Получить();
		                		
		ОтборРезультата.Загрузить(ДляЗаполнения.Отбор);
		Ресурсы.Загрузить(ДляЗаполнения.Ресурсы);
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДляЗаполнения.Параметры);
		
	 Иначе
	
	
	РегистрМетаданные = Метаданные.РегистрыНакопления[Параметры.ИмяРегистра];
	
	Для каждого Измерение из РегистрМетаданные.Измерения Цикл
		
		НоваяСтрока = ОтборРезультата.Добавить();
		НоваяСтрока.Использовать = Ложь;
		НоваяСтрока.Измерение = Измерение.Имя;
		НоваяСтрока.ТипИзмерения = Измерение.Тип;
		
	КонецЦикла;
	
	Для каждого Ресурс из РегистрМетаданные.Ресурсы Цикл
		
		НоваяСтрока = Ресурсы.Добавить();
		НоваяСтрока.Использовать = Ложь;
		НоваяСтрока.Ресурс = Ресурс.Имя;
		НоваяСтрока.ТипРесурса = Ресурс.Тип;

	КонецЦикла;
	
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	
	СтруктураСериализации = Новый Структура();
	СтруктураСериализации.Вставить("Версия", "1");
	СтруктураСериализации.Вставить("ИмяРегистра", "РегистрНакопления_" + Параметры.ИмяРегистра);
	СтруктураСериализации.Вставить("Параметры", Новый Структура("Портфель, Период, НачалоПериода, КонецПериода",
		Портфель, Период, ПериодОборотов.ДатаНачала, ПериодОборотов.ДатаОкончания));
	СтруктураСериализации.Вставить("Отбор", ОтборРезультата.Выгрузить());
	СтруктураСериализации.Вставить("Ресурсы", Ресурсы.Выгрузить());
	
	
	Хранилище = Новый ХранилищеЗначения(СтруктураСериализации);
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	Команда1НаСервере();
	
	ОповеститьОВыборе(Хранилище);
	
КонецПроцедуры


