
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаПериодОстатков.Видимость = Параметры.РежимОстатков;
	Элементы.ГруппаПериодОборотов.Видимость = НЕ Параметры.РежимОстатков;
	
	
	Элементы.ГруппаОтборОстатки.Видимость = Параметры.РежимОстатков;
	Элементы.ГруппаОтборОбороты.Видимость = НЕ Параметры.РежимОстатков;

	
	ЭтаФорма.Заголовок = "РегистрБухгалтерии." + Параметры.ИмяРегистра;
	
	РежимОстатков = Параметры.РежимОстатков;

	ЗаполнитьИсходныеДанные();
	         	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсходныеДанные()
	
	Если Параметры.Хранилище <> Неопределено Тогда
		
		ДляЗаполнения = Параметры.Хранилище.Получить();
		
		Если РежимОстатков Тогда  		
			
			ТаблицаЗагрузки = ОтборРезультата;

		Иначе
		
			ТаблицаЗагрузки = ОтборРезультатаОбороты;
			
			ПериодОборотов = Новый СтандартныйПериод(
				ДляЗаполнения.Параметры.НачалоПериода,
				ДляЗаполнения.Параметры.КонецПериода);
		КонецЕсли;
		
		Для каждого ЭлементОтбора из ДляЗаполнения.Отборы Цикл
			
			НоваяСтрока = ТаблицаЗагрузки.Добавить();
			
			НоваяСтрока.Счет = ЭлементОтбора.Счет;
			
			Для каждого Измерение из ЭлементОтбора.Измерения Цикл
				
				НоваяСтрока[Измерение.Ключ] = Измерение.Значение;
				
			КонецЦикла;
			
			Для каждого Ресурс из ЭлементОтбора.Ресурсы Цикл
				
				НоваяСтрока[Ресурс.Ключ] = Ресурс.Значение;
				
			КонецЦикла;
			   	
			
		КонецЦикла;
		
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДляЗаполнения.Параметры);
		 		
	КонецЕсли;
	    	    	
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	
	СтруктураСериализации = Новый Структура();
	СтруктураСериализации.Вставить("Версия", "1");
	СтруктураСериализации.Вставить("ИмяРегистра", "РегистрБухгалтерии_" + Параметры.ИмяРегистра);
	
	Если РежимОстатков Тогда  		
		
		ИменаИзмерений = СписокИменИзмеренийОстатков();
		ИменаРесурсов = СписокИменРесурсовОстатков();
		ТаблицаОтбора = ОтборРезультата;

		СтруктураСериализации.Вставить("Параметры", Новый Структура("Портфель, Период", Портфель, Период));
	Иначе
		
		ИменаИзмерений = СписокИменИзмеренийОборотов();
		ИменаРесурсов = СписокИменРесурсовОборотов();
		ТаблицаОтбора = ОтборРезультатаОбороты;
		
		СтруктураСериализации.Вставить("Параметры", Новый Структура("Портфель, НачалоПериода, КонецПериода",
		Портфель, ПериодОборотов.ДатаНачала, ПериодОборотов.ДатаОкончания));
		
		
		
	КонецЕсли;
	
	СтруктураСериализации.Вставить("Отборы", Новый Массив);
	
	Для каждого СтрокаОтбор Из ТаблицаОтбора Цикл
		
		Отбор = Новый Структура();
		
		Отбор.Вставить("Счет", СтрокаОтбор.Счет);
			
		Отбор.Вставить("Измерения", Новый Структура);
		
		Для Каждого ИмяИзмерения из ИменаИзмерений Цикл
			
			Если ЗначениеЗаполнено(СтрокаОтбор[ИмяИзмерения]) Тогда
				Отбор.Измерения.Вставить(ИмяИзмерения, СтрокаОтбор[ИмяИзмерения]);					
			КонецЕсли;   				
			
		КонецЦикла;
		
		Отбор.Вставить("Ресурсы",  Новый Структура);
		
		Для Каждого ИмяРесурса из ИменаРесурсов Цикл
			            			
			Если ЗначениеЗаполнено(СтрокаОтбор[ИмяРесурса]) Тогда
				Отбор.Ресурсы.Вставить(ИмяРесурса, СтрокаОтбор[ИмяРесурса]);						
			КонецЕсли;   				
			
		КонецЦикла; 
		
	СтруктураСериализации.Отборы.Добавить(Отбор);
		
	КонецЦикла;   	              	
	
	Хранилище = Новый ХранилищеЗначения(СтруктураСериализации);
	
КонецПроцедуры

Функция СписокИменИзмеренийОборотов()
	
	МассивИзмерений = новый Массив;
	
	МассивИзмерений.Добавить("Валюта");
	МассивИзмерений.Добавить("Субконто1");
	МассивИзмерений.Добавить("Субконто2");
	МассивИзмерений.Добавить("Субконто3");
	
	Возврат МассивИзмерений;
	
КонецФункции

Функция СписокИменИзмеренийОстатков()
	
	МассивИзмерений = новый Массив;
	
	МассивИзмерений.Добавить("Валюта");
	МассивИзмерений.Добавить("Субконто1");
	МассивИзмерений.Добавить("Субконто2");
	МассивИзмерений.Добавить("Субконто3");
	
	Возврат МассивИзмерений;
	
КонецФункции


Функция СписокИменРесурсовОборотов()
	
	МассивИзмерений = новый Массив;
	
	МассивИзмерений.Добавить("СуммаОборот");
	МассивИзмерений.Добавить("СуммаОборотДт");
	МассивИзмерений.Добавить("СуммаОборотКт");
	МассивИзмерений.Добавить("ВалютнаяСуммаОборот");
	МассивИзмерений.Добавить("ВалютнаяСуммаОборотДт");
	МассивИзмерений.Добавить("ВалютнаяСуммаОборотКт");
	
	Возврат МассивИзмерений;
	
КонецФункции

Функция СписокИменРесурсовОстатков()
	
	МассивИзмерений = новый Массив;
	
	МассивИзмерений.Добавить("СуммаОстаток");
	МассивИзмерений.Добавить("СуммаОстатокДт");
	МассивИзмерений.Добавить("СуммаОстатокКт");
	МассивИзмерений.Добавить("ВалютнаяСуммаОстаток");
	МассивИзмерений.Добавить("ВалютнаяСуммаОстатокДт");
	МассивИзмерений.Добавить("ВалютнаяСуммаОстатокКт");
	
	Возврат МассивИзмерений;
	
КонецФункции



&НаКлиенте
Процедура Команда1(Команда)
	
	Команда1НаСервере();
	
	ОповеститьОВыборе(Хранилище);
	
КонецПроцедуры


