
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаПериодОстатков.Видимость = Параметры.РежимОстатков;
	Элементы.ГруппаПериодОборотов.Видимость = НЕ Параметры.РежимОстатков;
	
	
	Элементы.ГруппаОтборОстатки.Видимость = Параметры.РежимОстатков;
	Элементы.ГруппаОтборОбороты.Видимость = НЕ Параметры.РежимОстатков;

	
	ЭтаФорма.Заголовок = "РегистрБухгалтерии." + Параметры.ИмяРегистра;
	
	РежимОстатков = Параметры.РежимОстатков;

	ЗаполнитьИсходныеДанные();
	         	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсходныеДанные()
	
	Если Параметры.Хранилище <> Неопределено Тогда
		
		ДляЗаполнения = Параметры.Хранилище.Получить();
		
		Если РежимОстатков Тогда  		
			ОтборРезультата.Загрузить(ДляЗаполнения.Отбор);
		Иначе
			ОтборРезультатаОбороты.Загрузить(ДляЗаполнения.Отбор);
		КонецЕсли;
				
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДляЗаполнения.Параметры);
		 		
	КонецЕсли;
	    	    	
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	
	СтруктураСериализации = Новый Структура();
	СтруктураСериализации.Вставить("Версия", "1");
	СтруктураСериализации.Вставить("ИмяРегистра", "РегистрБухгалтерии_" + Параметры.ИмяРегистра);
	
	Если РежимОстатков Тогда  		
		СтруктураСериализации.Вставить("Отбор", ОтборРезультата.Выгрузить());
		СтруктураСериализации.Вставить("Параметры", Новый Структура("Портфель, Период", Портфель, Период));
	Иначе
		СтруктураСериализации.Вставить("Отбор", ОтборРезультатаОбороты.Выгрузить());
			СтруктураСериализации.Вставить("Параметры", Новый Структура("Портфель, НачалоПериода, КонецПерио",
				Портфель, ПериодОборотов.ДатаНачала, ПериодОборотов.ДатаОкончания));

	КонецЕсли;

	
	Хранилище = Новый ХранилищеЗначения(СтруктураСериализации);
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	Команда1НаСервере();
	
	ОповеститьОВыборе(Хранилище);
	
КонецПроцедуры


