 
#Область СлужебныйПрограммныйИнтерфейс

#Область ДополнительныеОтчетыИОбработки

Функция СведенияОВнешнейОбработке() Экспорт
	
	МетаОбъект = ЭтотОбъект.Метаданные();
	                  
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вид = "ДополнительнаяОбработка";		
	ПараметрыРегистрации.Наименование = МетаОбъект.Синоним;
	ПараметрыРегистрации.Версия = "0.20";	
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Информация = МетаОбъект.Комментарий;
		
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецОбласти 


#КонецОбласти 
