 
#Область СлужебныйПрограммныйИнтерфейс

#Область ДополнительныеОтчетыИОбработки

Функция СведенияОВнешнейОбработке() Экспорт
	
	МетаОбъект = ЭтотОбъект.Метаданные();
	                  
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вид = "ДополнительнаяОбработка";		
	ПараметрыРегистрации.Наименование = МетаОбъект.Синоним;
	ПараметрыРегистрации.Версия = Версия();	
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Информация = МетаОбъект.Комментарий;
		
	Возврат ПараметрыРегистрации;
	
КонецФункции


Функция Версия()  Экспорт
	
	Возврат "0.27";
	
КонецФункции


#КонецОбласти 


#КонецОбласти 
